In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('_data/Tab1.xlsx')
df2 = pd.read_excel('_data/Tab2.xlsx')
df3 = pd.read_excel('_data/Tab3.xlsx')

In [3]:
df1.shape

(18, 5)

In [4]:
df2.shape

(75, 5)

In [5]:
df3.shape

(80, 4)

In [6]:
df1.head()

                         Nome           RG          CPF Sexo  Nascimento
0            Clarice Gonzales  88829099450  49492282913    F  2008-02-25
1            Maria Isis Ramos  43437187759  83067956448    F  1999-02-27
2               Daniela Palma  58946054283  32723668271    M  1982-03-03
3  Maria da Conceição Antunes  23000712291  39961145321    F  1973-03-05
4          Valentina Williams  68948263392  39936634316    F  1956-03-09

In [7]:
df2.head()

                   Nome           RG          CPF Sexo  Nascimento
0         Augusto Baker  81824421711  70554061465    M  1999-02-27
1    Luiz Gustavo Perez  77235684057  59926297524    M  1978-03-04
2        Letícia Martin  57236082885  62735631735    F  1992-02-29
3  Maria Eduarda Parker  66977452731  39540568538    F  1996-02-28
4        Ricardo Taylor  39605161020  63099392510    M  1982-03-03

In [8]:
df3.head()

           CPF  Altura  Peso  Doenca
0  59482859931    1.73  62.1       0
1  68817507213    1.47  75.6       1
2  76930633538    1.44  45.6       0
3  47303402300    1.58  47.4       0
4  70554061465    1.58  57.5       0

## Union all

In [9]:
df_union = df1.append(df2)

In [10]:
df_union.shape

(93, 5)

In [11]:
str(df1.shape[0]) + ' + ' + str(df2.shape[0]) + ' = ' + str(df_union.shape[0])

'18 + 75 = 93'

In [12]:
df_union

                          Nome           RG          CPF Sexo  Nascimento
0             Clarice Gonzales  88829099450  49492282913    F  2008-02-25
1             Maria Isis Ramos  43437187759  83067956448    F  1999-02-27
2                Daniela Palma  58946054283  32723668271    M  1982-03-03
3   Maria da Conceição Antunes  23000712291  39961145321    F  1973-03-05
4           Valentina Williams  68948263392  39936634316    F  1956-03-09
..                         ...          ...          ...  ...         ...
70         Pedro Henrique Ross  50510137436  49456444753    M  2000-02-27
71           Maria Laura Reyes  83292267664  55681722009    F  1960-03-08
72         Maria Almeida Prado  75070228106  31611277812    F  1954-03-10
73                   Cauã Cook  93595616453  59422748376    M  1991-03-01
74                    Lara Lee  88508679718  38284947986    F  2013-02-23

[93 rows x 5 columns]

## Inner join

In [13]:
df_join = pd.merge(df_union, df3, on=['CPF'])

In [14]:
df_join.shape

(76, 8)

In [15]:
str(df_union.shape[0]) + ' + ' + str(df3.shape[0]) + ' = ' + str(df_join.shape[0])

'93 + 80 = 76'

In [16]:
df_join

,Nome,RG,CPF,Sexo,Nascimento,Altura,Peso,Doenca
0,Clarice Gonzales,88829099450,49492282913,F,2008-02-25,1.53,46.4,0
1,Maria Isis Ramos,43437187759,83067956448,F,1999-02-27,1.58,57.5,0
2,Daniela Palma,58946054283,32723668271,M,1982-03-03,1.50,63.3,0
3,Maria da Conceição Antunes,23000712291,39961145321,F,1973-03-05,1.69,70.6,0
4,Valentina Williams,68948263392,39936634316,F,1956-03-09,1.67,65.6,0
...,...,...,...,...,...,...,...,...
71,Erick Gonzales,70072604602,28965076874,M,1957-03-09,1.56,69.1,0
72,Maria Elisa Patel,48466221259,87576076064,F,2001-02-26,1.51,49.0,0
73,Maria Laura Reyes,83292267664,55681722009,F,1960-03-08,1.59,66.3,0
74,Cauã Cook,93595616453,59422748376,M,1991-03-01,1.67,61.4,0
75,Lara Lee,88508679718,38284947986,F,2013-02-23,1.24,27.3,0

In [17]:
df_join.isnull().any(axis=0)

Nome          False
RG            False
CPF           False
Sexo          False
Nascimento    False
Altura        False
Peso          False
Doenca        False
dtype: bool

## Left join

In [18]:
df_join_left = pd.merge(df_union, df3, on=['CPF'], how='left')

In [19]:
df_join_left.shape

(93, 8)

In [20]:
str(df_union.shape[0]) + ' + ' + str(df3.shape[0]) + ' = ' + str(df_join_left.shape[0])

'93 + 80 = 93'

In [21]:
df_join_left

,Nome,RG,CPF,Sexo,Nascimento,Altura,Peso,Doenca
0,Clarice Gonzales,88829099450,49492282913,F,2008-02-25,1.53,46.4,0.0
1,Maria Isis Ramos,43437187759,83067956448,F,1999-02-27,1.58,57.5,0.0
2,Daniela Palma,58946054283,32723668271,M,1982-03-03,1.50,63.3,0.0
3,Maria da Conceição Antunes,23000712291,39961145321,F,1973-03-05,1.69,70.6,0.0
4,Valentina Williams,68948263392,39936634316,F,1956-03-09,1.67,65.6,0.0
...,...,...,...,...,...,...,...,...
88,Pedro Henrique Ross,50510137436,49456444753,M,2000-02-27,NaN,NaN,NaN
89,Maria Laura Reyes,83292267664,55681722009,F,1960-03-08,1.59,66.3,0.0
90,Maria Almeida Prado,75070228106,31611277812,F,1954-03-10,NaN,NaN,NaN
91,Cauã Cook,93595616453,59422748376,M,1991-03-01,1.67,61.4,0.0
92,Lara Lee,88508679718,38284947986,F,2013-02-23,1.24,27.3,0.0

In [22]:
df_join_left.isnull().any(axis=0)

Nome          False
RG            False
CPF           False
Sexo          False
Nascimento    False
Altura         True
Peso           True
Doenca         True
dtype: bool

## Right join

In [23]:
df_join_right = pd.merge(df_union, df3, on=['CPF'], how='right')

In [24]:
df_join_right.shape

(80, 8)

In [25]:
str(df_union.shape[0]) + ' + ' + str(df3.shape[0]) + ' = ' + str(df_join_right.shape[0])

'93 + 80 = 80'

In [26]:
df_join_right

,Nome,RG,CPF,Sexo,Nascimento,Altura,Peso,Doenca
0,André Allen,9.981651e+10,59482859931,M,1995-02-28,1.73,62.1,0
1,Rafaela Turner,8.157228e+10,68817507213,F,1975-03-05,1.47,75.6,1
2,Enrico Foster,8.544740e+10,76930633538,M,2007-02-25,1.44,45.6,0
3,Nicolau Silva Júnior,5.887614e+10,47303402300,M,2005-02-25,1.58,47.4,0
4,Augusto Baker,8.182442e+10,70554061465,M,1999-02-27,1.58,57.5,0
...,...,...,...,...,...,...,...,...
75,Erick Gonzales,7.007260e+10,28965076874,M,1957-03-09,1.56,69.1,0
76,Yasmin Wood,3.073330e+10,76110396505,F,1960-03-08,1.59,66.3,0
77,Maria Elisa Patel,4.846622e+10,87576076064,F,2001-02-26,1.51,49.0,0
78,Lara Lee,8.850868e+10,38284947986,F,2013-02-23,1.24,27.3,0
79,Giovanna Howard,8.558208e+10,78532093277,F,1966-03-07,1.59,66.3,0

In [27]:
df_join_right.isnull().any(axis=0)

Nome           True
RG             True
CPF           False
Sexo           True
Nascimento     True
Altura        False
Peso          False
Doenca        False
dtype: bool